<!DOCTYPE html>
<html>
  <head>
    <title>VIVVO als SPARQL-Endpoint</title>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
    <style type="text/css">
      @import url(https://fonts.googleapis.com/css?family=Yanone+Kaffeesatz);
      @import url(https://fonts.googleapis.com/css?family=Droid+Serif:400,700,400italic);
      @import url(https://fonts.googleapis.com/css?family=Ubuntu+Mono:400,700,400italic);

      body { font-family: 'Droid Serif'; }
      h1, h2, h3 {
        font-family: 'Yanone Kaffeesatz';
        font-weight: normal;
      }
      .remark-code, .remark-inline-code { font-family: 'Ubuntu Mono'; }
      table { font-family: 'Ubuntu Mono'; border-collapse: collapse; }
      th { 
        text-align: left;
        border-bottom:solid 1px black;
        padding: 2px 5px;
      }
      tbody tr:nth-child(even) {
        background: #ccc;
      }
      td {
        padding: 5px 8px;
      }


    </style>
  </head>
  <body>
    <textarea id="source">

# Was ist VIVO?

- Forschungsinformationssystem mit Daten über Organisationen, Personen und Veröffentlichungen.
- Daten werden als RDF gespeichert.

---

# Was ist RDF
- RDF = **R**esource **D**escription **F**ramework  
- Ressourcen sehen aus wie URLs.
- Beschreibung immer als Tripel - Subjekt Prädikat Objekt
- Subjekt und Prädikat ist immer eine Ressource, Objekt kann eine Ressource oder ein Literal sein.
- Bedeutungsdefinition in Form von **Ontologien** (Sammlung von Ressourcen, die jeweils eine bestimmte Bedeutung haben)
- Unabhängig von Repräsentation (Notation). Repräsentationen sind u.a. XML, N3 und Turtle.

---

# Beispiel-RDF in Turtle

```Turtle
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix foaf: <http://xmlns.com/foaf/0.1/> .

<http://vivo.mydomain.edu/individual/p00000105> 
    a foaf:Person ;
    rdfs:label "Schmidt, JH" ;
    vcard:hasName <http://vivo.mydomain.edu/individual/i000001058> .
```

---

# Erklärung Turtle
- Präfix statt kompletter URL

```Turtle
@prefix foaf: <http://xmlns.com/foaf/0.1/> .
<http://vivo.mydomain.edu/individual/p00000105>  
    a foaf:Person ;
```

statt

```Turtle
<http://vivo.mydomain.edu/individual/p00000105>  
    a <http://xmlns.com/foaf/0.1/Person> ;
```

---

# Erklärung Turtle
- Punkt am Ende des Statements
- Semikolon, um sich auf das selbe Subjekt zu beziehen.

```Turtle
<http://vivo.mydomain.edu/individual/p00000105> 
    a          foaf:Person ;
    rdfs:label "Schmidt, JH" .
```

statt

```Turtle
<http://vivo.mydomain.edu/individual/p00000105> a          foaf:Person .
<http://vivo.mydomain.edu/individual/p00000105> rdfs:label "Schmidt, JH" .
```

---

# Was ist SPARQL?
- Abfragesprache für RDF-Daten.  
- SPARQL =  **S**PARQL **P**rotocol **a**nd **R**DF **Q**uery **L**anguage
- Benutzt Turtle-Repräsentation
- Ähnlich SQL
- Vorteile ggü. SQL: 
  - Keine feste Tabellen-Struktur notwendig
  - Alles mit allem verknüpfbar
  - Externe SPARQL-Quellen

---

# Die erste SPARQL-Query
## Gib mir alle Personen

```SPARQL
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?p
WHERE {
    ?p a foaf:Person
}
LIMIT 10
```

- Platzhalter beginnen mit `?`
- Platzhalter in SELECT sind Spalten-Überschriften

---

# Die erste SPARQL-Query
## Ergebnis

| p                                               |
|-------------------------------------------------|
| `<http://vivo.mydomain.edu/individual/p00000084>` |
| `<http://vivo.mydomain.edu/individual/p00000104>` |
| `<http://vivo.mydomain.edu/individual/p00000585>` |
| `<http://vivo.mydomain.edu/individual/p00000212>` |
| `<http://vivo.mydomain.edu/individual/p00000111>` |
| `<http://vivo.mydomain.edu/individual/p00000083>` |
| `<http://vivo.mydomain.edu/individual/p00000123>` |
| `<http://vivo.mydomain.edu/individual/p00000177>` |
| `<http://vivo.mydomain.edu/individual/p00000043>` |
| `<http://vivo.mydomain.edu/individual/p00000138>` |


Wir sehen hier die *Ressourcen*, das *R* in RDF. 

---

# Query nach Personen-Namen
Was ist, wenn wir die Namen wollen?

```SPARQL
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
SELECT ?nachname ?vorname ?p
WHERE {
    ?p          a                   foaf:Person ;
                vcard:hasName       ?vcardname .
    ?vcardname  vcard:familyName    ?nachname ;
                vcard:givenName     ?vorname .
}
LIMIT 10
```

- Beispiel für Turtle-Notation: Semikolon, um sich auf das selbe Subjekt zu beziehen.
- Alle Bedingungen müssen erfüllt sein
- Platzhalter können auch nur intern verwendet werden. 
- `?vcardname` ist _gebunden_: alle Werte von `?vcardname` müssen gleich sein.
- `?vcardname` ist sowohl subjekt als auch objekt in verschiedenen statements.

---

# Query nach Personen-Namen

nachname      | vorname       | p                                               
----------------|---------------|------------------------------------------------
"Noy Natalya" | "F"           | `<http://vivo.mydomain.edu/individual/p00000585>` 
"Onn Kow"     | "Weng"        | `<http://vivo.mydomain.edu/individual/p00000212>` 
"Anderson"    | "CW"          | `<http://vivo.mydomain.edu/individual/p00000111>` 
"Strohmaier"  | "Markus"      | `<http://vivo.mydomain.edu/individual/p00000123>` 
"Maurer"      | "Lisa"        | `<http://vivo.mydomain.edu/individual/p00000177>` 
"Kroell"      | "Mark"        | `<http://vivo.mydomain.edu/individual/p00000138>` 
"Hofmair"     | "P"           | `<http://vivo.mydomain.edu/individual/p00000475>` 
"Balzert"     | "Silke"       | `<http://vivo.mydomain.edu/individual/p00000262>` 
"Tschinkel"   | "Gerwald"     | `<http://vivo.mydomain.edu/individual/p00000310>` 


---

# Welche Organisation hat wie viele Mitglieder?



organization_name                                                | num_people
-----------------------------------------------------------------|-------------
"Know Center"                                                    | 1
"Alexander von Humboldt Institut für Internet und Gesellschaft"  | 88
"ZBW – Deutsche Zentralbibliothek für Wirtschaftswissenschaften" | 4


---

# In welchem Jahr wurde wie viel publiziert?

pub_year | num_publications
---------|------------------
2004     | 17
2005     | 45
2006     | 52
2007     | 55
2008     | 58
2009     | 86
2010     | 59
2011     | 44
2012     | 49
2013     | 73
2014     | 29

---

# Publikationslisten


authors | publication_name
--- | ---
"Christl, Conny; Lindstaedt Stefanie, N; Kump, Barbara"                                                      | "Die gezielte Nutzung innerbetrieblicher Ressourcen für effektiven Kompetenztransfer"
"Zibold, D; Hubmann-Haidvogel, A; Stern, Hermann; Weichselbraun, Albert; Scharl, Arno; Wohlgenannt, Gerhard" | "Media Watch on Climate Change: Building and Visualizing Contextualized Information Spaces"
"Ley, Tobias; Kump, Barbara; Bonestroo, W; Lindstaedt Stefanie, N"                                           | "Learn@Work: Competency Advancement with Learning Templates"
"Ulbrich, Armin; Ausserhofer, A"                                                                             | "Aspects of Integrating E-Learning Systems With Knowledge Management"
"Voss, H"                                                                                                    | " Crowdsourcing. "
"Burgsteiner, H; Steinbauer, G; Kroell, Mark; Leopold, A"                                                    | "Movement Prediction From Real-World Images Using A Liquid State Machine"


---

# Wer publiziert mit wem?


first_author    | second_author
----------------|-------------------
"Ademi, Ilir"            | "Mayer, Harald"
"Ademi, Ilir"            | "Stocker, Alexander"
"Ademi, Ilir"            | "Halb, Wolfgang"
"Ademi, Ilir"            | "Mülner, Helmut"
"Aehnelt, M"             | "Beham, Guenther"
"Aehnelt, M"             | "de Hoog, Robert"
"Aehnelt, M"             | "Ebert, M"
"Aehnelt, M"             | "Paschen, A"
"Afzal Muhammad, Tanvir" | "Andrews, Keith"
"Afzal Muhammad, Tanvir" | "Stocker, Alexander"
"Afzal Muhammad, Tanvir" | "Maurer, Hermann"
"Afzal Muhammad, Tanvir" | "Hoefler, Patrick"


---


# Wer publiziert am meisten mit wem?


firstauthor              | secondauthor             | pub_count
-------------------------|--------------------------|------------
"Granitzer, Michael"     | "Sabol, Vedran"          | 39
"Sabol, Vedran"          | "Granitzer, Michael"     | 39
"Kienreich, Wolfgang"    | "Sabol, Vedran"          | 31
"Sabol, Vedran"          | "Kienreich, Wolfgang"    | 31
"Granitzer, Michael"     | "Kienreich, Wolfgang"    | 28
"Kienreich, Wolfgang"    | "Granitzer, Michael"     | 28
"Granitzer, Michael"     | "Kern, Roman"            | 22
"Kern, Roman"            | "Granitzer, Michael"     | 22
"Granitzer, Michael"     | "Juffinger, Andreas"     | 20
"Juffinger, Andreas"     | "Granitzer, Michael"     | 20
"Granitzer, Michael"     | "Seifert, Christin"      | 19
"Seifert, Christin"      | "Granitzer, Michael"     | 19





    </textarea>
    <script src="https://gnab.github.io/remark/downloads/remark-latest.min.js">
    </script>
    <script>
      var slideshow = remark.create();
    </script>
  </body>
</html>